-- Практична робота №7
-- Варіант 4 — Фітнес-трекер
-- Цей файл містить реальний SQL створення індексу
-- та перевірку плану виконання через EXPLAIN.

-- 1. Перевірка ДО створення індексу.
-- Якщо індекс idx_workouts_type вже існує,
-- цей результат, звичайно, вже покаже його використання.
EXPLAIN
SELECT *
FROM workouts
WHERE type = 'Біг';


-- 2. Створення індексу.
-- Команду потрібно виконати один раз.
CREATE INDEX idx_workouts_type
ON workouts (type);


-- 3. Перевірка ПІСЛЯ створення індексу.
EXPLAIN
SELECT *
FROM workouts
WHERE type = 'Біг';
